In [13]:
import pandas as pd
import numpy as np

In [2]:
# Creating Dataframe using Dictionary
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

In [3]:
pd.DataFrame(data)

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [8]:
# creating Dataframe using python list 
data_list=[["Suraj",84],["Aditya",90],["Swami",94],["Kunal",87]]

In [11]:
pd.DataFrame(data_list,columns=["Name","Marks"])

     Name  Marks
0   Suraj     84
1  Aditya     90
2   Swami     94
3   Kunal     87

In [14]:
# creating Dataframe using numpy arrays
arr=np.array([[1,2,3],[4,5,6]])

In [15]:
df=pd.DataFrame(arr,columns=['a','b','c'])

In [16]:
df

   a  b  c
0  1  2  3
1  4  5  6

In [18]:
# read Excel file 
pd.read_excel("data.xlsx")

       name  age  marks
0     suraj   20     88
1     swami   20     87
2     kunal   20     78
3    aditya   20     97
4        om   18     78
5    pranay   20     81
6    tanmay   20     89
7  mayuresh   19     80
8     rahul   19     88

In [19]:
pd.read_csv("data.csv")

       name  age  marks
0     suraj   20     88
1     swami   20     87
2     kunal   20     78
3    aditya   20     97
4        om   18     78
5    pranay   20     81
6    tanmay   20     89
7  mayuresh   19     80
8     rahul   19     88

In [27]:
df=pd.read_json("data.json")

In [28]:
df

    name    lang  age
0  suraj  python   20
1  swami  python   20

In [30]:
df=pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")

In [31]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [40]:
# EDA exponential data analysis using pandas (use for deeplook of our dataset )
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [41]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [43]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [44]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [45]:
df.shape

(244, 7)